{"_id":{"$oid":"56fe9e22bad6b23cde07b8b8"},"definition":" n. Assemblage of Computer Maniacs, a group of wanted criminals at the VCC.","word":"ACM"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8b7"},"definition":" exp. Equivalent to ``gag.''","word":"Ack"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8b9"},"definition":" n. Solar Collector on top of the Science Center. Also known as the Laser Cannon.","word":"Alien Death Ray"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ba"},"definition":" n. The act of staying up all night to complete some project before the deadline.","word":"All-nighter"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8bb"},"definition":" n. (RPI) A peculiar ethereal atmosphere indigenous to RPI, generated by the individual students' lack of concern for the events of the Real World. It works in inverse proportion to distance away from Troy and in direct proportion to the distance to Home, i.e., when you return to the nest you care once again. However, it also has hysterical properties and takes a certain amount of time to wear off.","word":"Apathy Field"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8bd"},"definition":" n. Something that can be put anywhere for any reason and not harmfully affect the outcome of any given event. See Fudge Factor.","word":"Arbitrary Constant"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8bc"},"definition":" n. (RPI) The decaying ruins of the old Rensselaer gateway from Troy.","word":"Approach"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8be"},"definition":" n.  Bullshit. No, really. Symbolized by the ``Right Hand Rule,'' see Halliday and Resnick for the formal definition.","word":"B-Vector"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c0"},"definition":" adv. In discrete lumps.","word":"Batch"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8bf"},"definition":" n., acronym. (RPI) Burdett Avenue Resident Housing, the only REAL co-ed dorm on campus with its own bad version of DAKA. This place has a history of being a wild party dorm, thanks to the non-homogeneous population. Originally called the Burdett Avenue Residence Facility (BARF).","word":"BARH"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c1"},"definition":" n. A main staple of the Rensselaer Diet.","word":"Beer"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c2"},"definition":" exp. (RPI) A more serious version of alarm, not to be confused with ``Be Like A Real Man.''","word":"Blarm"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c3"},"definition":" v. To be forced off MTS by the operator, owing to some ``fatal'' computer error.","word":"Blast"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c4"},"definition":" exp. A sound of disgust. --- adj.  --- blecherous.  To be disgusting. Also spelled ``Bletch'' and ``Bletcherous.''","word":"Blech"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c5"},"definition":" v. To lose big, or fail miserably.","word":"Blow Away"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c6"},"definition":" v. To disregard; see Punt.","word":"Blow Off"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c7"},"definition":" n. A very random and unpredictable sort of motion. Best typified by, say, a nice hot cup of tea. (Also see Halliday and Resnick.)","word":"Brownian Motion"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c8"},"definition":" n. Your first degree, assuming you finish.","word":"B.S."}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8c9"},"definition":" n. The Center for Industrial Innovation, or CII, as translated by lovers of Roman numerals.","word":"Building 102"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ca"},"definition":" v. To erase, eradicate or otherwise remove from the face of the Earth.","word":"Bulk"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8cb"},"definition":" n. (RPI) For those who don't listen to WPYX, and still don't know this term, it means Albany and Rensselaer Counties and the general surrounding area.","word":"Capitaland"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8cc"},"definition":" n.  A package containing munchies, junk food and probably a stuffed animal, intended to ease homesickness.","word":"Care Package"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ce"},"definition":" n.  (RPI) The ubiquitous supermarket of the Capital District and all-time favorite food store for RPI students.  Also called ``Price Gouger'' or ``Price Hacker.''","word":"Chopper"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8cf"},"definition":" n. (RPI) Two Rectangles Vertical Gyratory Up, a kinetic metal sculpture which was lent to the Institute by the sculptor, George Rickey, a professor at RPI from 1961 to 1966.  Often confused with meteorological equipment on the Science Center. Although gone, it may be coming back.","word":"Chrinitoid"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d0"},"definition":" n. A xerox, but more so. Did you know that clones never use mirrors?","word":"Clone"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8cd"},"definition":" n. The nerd-food restaurant in the Folsom Library.","word":"Chez Stavo"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d1"},"definition":" n. A very peculiar game which defies explanation, you just have to play it to understand it.","word":"Cosmic Wimpout"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d3"},"definition":" v. The act of Sibyl going to sleep, or as most Comp Sci's put it, ``going down.'' --- n. You'll know Him when you meet Him.","word":"Crash"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d4"},"definition":" n.  Something that is small, and usually alive (though many critters fake it).","word":"Critter"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d5"},"definition":" n. see QPA.","word":"Cume"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d6"},"definition":" n. (RPI) The name for the phenomenon that results in so many students receiving so many C's.","word":"C Vortex"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d7"},"definition":" n., acronym. (RPI) Dining And Kitchen Administration.  The generic food company vested with the task of creating food out of flup for the FDH, Union and BARH.","word":"DAKA"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d8"},"definition":" v. To destroy, delete or eliminate.","word":"De-rez"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d9"},"definition":" n., acronym.  Decelerated Undergraduate Matriculation Program, otherwise known as the five year Bachelor of Science degree.","word":"DUMP"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8da"},"definition":" n. see Loop, Endless.","word":"Endless Loop"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8d2"},"definition":" n. Sedentary lifeform most prevalent on low slung sofas and lounges around the campus. Best sightings are in the JEC Lounge, the second floor of the Union and on every floor of the Folsom Library.","word":"Couch Potato"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8db"},"definition":" adj. Incorrect to the point of humorous.","word":"Faulty"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8dd"},"definition":" exp. A word of disgust.","word":"Feh"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8de"},"definition":" v. 1. to boast. 2. to complain, sometimes vehemently. --- n. Someone who flames.","word":"Flame"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8dc"},"definition":" n. F*cking Computer Nerd (one of the few cases in which ``nerd'' is preferred to ``knurd'' because ``FCK'' is too similar to a very favorite word of all RPI students). Not uncommon for this type to be verbally fluent in Fortran or Assembler.","word":"FCN"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8df"},"definition":" v.  (RPI) To secure one's stay at RPI with grades too low to transfer elsewhere. --- adj. Flunked In.","word":"Flunking In"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e1"},"definition":" n., acronym. ``F*ck Off And Die.''","word":"FOAD"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e2"},"definition":" n.  A letter from a company which says, ``We liked your resume, and had a real good time laughing at it, and we don't want to hire you now, but (chuckle) please (snort) try again (hee, hee) later. (Haw, haw, haw!)''  Usually received at the end of your senior year, and whenever you apply for a co-op or a summer job.  Most RPI seniors receive five or six of them.","word":"FOAD Letter"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e0"},"definition":" n.  (Niven) Sea-bottom ooze; very fine, fertile mud which is useful for gardens and green, growing things. (Like mold.) Also see: DAKA.","word":"Flup"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e4"},"definition":" n. Fortran, to those who know it well.","word":"Fortrash"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e5"},"definition":" n. A cryptic chart depicting each and every force, accountable or otherwise, in a force system.","word":"Free Body Diagram"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e3"},"definition":" n. Generic pronoun. (Others are: Bar, Zot.)","word":"Foo"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e7"},"definition":" n.  Amount of discrepancy added to lab data to make it agree with theoretical results.","word":"Fudge Factor"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e8"},"definition":" n. God-Damned Independent, as opposed to a frat-rat.","word":"GDI"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e6"},"definition":" n., acronym. Factor Reality into the Situation.","word":"FRITZ"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8e9"},"definition":" n. (RPI) A week long festival, cleverly chosen so as to lie three weeks before finals and still within winter, during which students drink themselves into a stupor, and occasionally, by accident, vote for student officials.","word":"GM Week"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ea"},"definition":" n. (RPI) Favorite nick-name of Price Chopper.","word":"Gouger"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8eb"},"definition":" n. General Personal Aptitude, the rating by which the rest of the world values your existence. Though you'll hear of these, RPI won't give you one; being a technical school, they have to complicate it. See QPA.","word":"GPA"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ed"},"definition":" n.  (RPI) One of the many anomalies at RPI, this structure houses the School of Architecture and is not at all green.","word":"Greene Building"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ee"},"definition":" n. A type of human that can directly interface with Sibyl with every means short of psychic communication, and does so for a large percentage of its non-sleeping life.  Can find interfacing with other humans too difficult to bother. Treatment is available for these types; drag them over to the Counseling Center.","word":"Hacker"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ec"},"definition":" n. Another word for masochist, this type of student is notable for being forced to teach undergrads in his second language, English.","word":"Gradual Student"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f0"},"definition":" n.  (RPI) The source of steam between the VCC, the Folsom Library and the Amos Eaton building.","word":"Hill Saint Helens"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f1"},"definition":" n. (RPI) An annual sit-in, the biggest at RPI since the takeover of the Pittsburgh Building in the early 70's, where intrepid students wait over a month (the current record is 35 days, 20 hours by the Polemic Staff) for the best tickets.","word":"Hockey Line"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f2"},"definition":" n. (RPI) Happy Valley Country Club, where most of RPI's Square Root Club members retire for a semester or two.","word":"HVCC"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f3"},"definition":" n. Pertaining to input and output operations, like sex and eating.","word":"I-O"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ef"},"definition":" n.  An annual week during which pledges to RPI Fraternities undergo group therapy, which includes dressing oddly, indulging in silly walks, and the most suits on campus at any time other than Placement Interviews.","word":"Hell Week"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f5"},"definition":" v. To branch, as in a program. To travel, usually by car.","word":"Jump"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f4"},"definition":" exp. One small step for a TA, one giant leap for the student.","word":"Intuitively Obvious"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f6"},"definition":" n., acronym. Keep it Simple, Stupid.","word":"KISS"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f8"},"definition":" n. One who studies intensively, but only for practical reasons, such as an exam tomorrow. Preferred to ``nerd'' due to it's nature of being reversible into another useful word.","word":"Knurd"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f7"},"definition":" n.  Any alteration or assemblage which takes advantage of faulty rules or organization.  --- v.  To fix in a temporary way (note: long ``u'' as in ``nUke'').","word":"Kludge"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8f9"},"definition":" n. A practical exercise in Finagle's Law.","word":"Lab Report"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8fa"},"definition":" v. to attach oneself onto.","word":"Latch"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8fc"},"definition":" n. See Endless Loop.","word":"Loop, Endless"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8fd"},"definition":" n.  (RPI) The RPI Players main hideout, the 15th Street Playhouse, as it is referred to by the Players.","word":"Lounge"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8fe"},"definition":" n.  The ``temporary'' pathway along the '86 Field, which turns into some kind of toxic sludge whenever Troy rains or snows (which is far too frequent). Don't slip and fall into it.","word":"Love Canal"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8ff"},"definition":" n.  The free newsprint magazine that gets distributed every Thursday, available in the Union if you're quick. Sometimes called Metrobland because, while informative on what's happening in the capital district, it really doesn't tell you much. Good reviews though.","word":"Metroland"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b900"},"definition":" n., acronym. (RPI) Meanest Man On Campus, a title held by whoever collects the most money during GM week for an APO funds drive, has the silliest name and throws the least pies.","word":"MMOC"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b901"},"definition":" n. (RPI) Brownian electronic tellers on the west side of the Union which randomly allocate funds.","word":"MoneyMaybe Machines"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b8fb"},"definition":" n. The Nuclear Department's linear accelerator, which is aimed directly at Troy's main water tower, the Space Invader. It is mainly used to project matter out of the Known Universe.","word":"Lineac"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b902"},"definition":" n. (RPI) The familiar letters that greet all of Sibyl's users, the Message Terminal System (for those of us who use $MESSAGESYSTEM more than the operating system).","word":"MTS"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b903"},"definition":" n.  A variable word pertaining to any noun, object or thing.","word":"Mumble"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b904"},"definition":" v., acronym.  A recursive word, meaning ``MUNG Until No Good.''","word":"MUNG"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b905"},"definition":" n.  (RPI) The old campus mainframe computer, rumored to still be in the basement of the Voorhees Computing Center.","word":"Myron"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b906"},"definition":" n. Meaning any number of items, usually tending to positive infinity.","word":"N"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b907"},"definition":" n. Any of several devices that vend unnatural and artificially flavored food-stuff for late night feeders. The largest collections are in the JEC Lounge, the Field House, and the Folsom Library.","word":"Nerd Feeder"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b908"},"definition":" exp. A greeting call for many on campus.","word":"Ni"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b90a"},"definition":" n.  Someone or thing that does nothing useful. --- v. To waste time by ``slugging off.'' To ignore something.","word":"No Op"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b90b"},"definition":" n.  Referring to anything nuclear, including weapons, power or radiation. --- v. To eradicate or obliterate.","word":"Nuke"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b909"},"definition":" n.  (RPI) Abbreviation for Niagara Mohawk, the Troy power company.","word":"Ni-Mo"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b90c"},"definition":" n. The device resembling a terminal in any RPI-provided kit-chen, it is used to heat food and eradicate numerous forms of matter in general.","word":"Nukerowave"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b90e"},"definition":" n. The Hudson River, DAKA food, chem labs.","word":"Organic Waste Products"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b90d"},"definition":" n. The existential penguin in ``Bloom County,'' a comic strip that can only be found in The Boston Globe, and occasionally in The Poly.","word":"Opus"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b910"},"definition":" v.  The act of convincing your parents that the $15K a year spent on your lifesupport at RPI is worth the expense, despite your grades.","word":"Parental Maintenance"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b90f"},"definition":" n. Parental units, Pa and Ma.","word":"P \u0026 M"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b911"},"definition":" n. A social gathering with a goal of mixed group interrelating, drinking, etc. --- v. To enjoy the company of others and not be involved in studying. --- adj. To be desirable to have at a party (e.g. ``He's quite a party guy'').","word":"Party"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b912"},"definition":" n.  One of the options available to a Tute student. A class on Pass-Punt does not count against you if you fail or do poorly; it also does not help your GPA even if you do incredibly well. Officially called ``Pass-No Credit.''","word":"Pass-Punt"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b913"},"definition":" n. The perforated strips of paper that come off of computer printouts. Makes great confetti.","word":"Perf"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b915"},"definition":" n.  (RPI) The independent, student financed, somewhat-bi-weekly spoof of the Institute's newspaper, the Polytechnic. Otherwise known as ``Not the Poly.''","word":"Polemic"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b916"},"definition":" v. to INTENSIVELY study; see tool.","word":"Power Tool"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b917"},"definition":" n. 1. Hockey Player type. 2. Any crusty piece of food served by DAKA, often passed off as meat. They come in three varieties: poultry-flavored, fish-flavored, and other (which is usually the veal).","word":"Puck"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b918"},"definition":" v. To drop, reject or ignore, as in classes.","word":"Punt"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b919"},"definition":" n.  Rejection letter.  Primarily used to designate rejection letters from the Tute. Rejection letters from companies are usually referred to as FOAD letters.","word":"Puntogram"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b91a"},"definition":" n. (RPI) Basically, a sexual experience test.","word":"Purity Test"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b91b"},"definition":" n.  A complicated version of the GPA, this stands for Quality Person Average, your mean value of total worth in relation to Reality.","word":"QPA"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b91c"},"definition":" n.  (RPI) The three-sided upperclassman housing structure across from the Union.","word":"Quad"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b91d"},"definition":" adj. To be diverse in nature.","word":"Random"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b91e"},"definition":" n., acronym.  (RPI) Rensselaer Apartment Housing Project, is better known as the Alpha Phi Omega fraternity ``house.''","word":"RAHP"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b91f"},"definition":" adv. Describing how an action occurs, meaning that it is happening instantly.  --- n. Referring to actual or current events as opposed to the past.","word":"Real Time"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b920"},"definition":" n. (RPI) The Known Universe, minus the RPI environment, which is sheltered in an Apathy Field.","word":"Real World"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b921"},"definition":" n. The Known Universe.","word":"Reality"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b922"},"definition":" n. The act of leaping up once to see if one will still fall Earthward under the influence of gravity.  Also known as ``Gravity Check.''","word":"Reality Check"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b923"},"definition":" adj. See recursive.","word":"Recursive"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b924"},"definition":" v. To create or originate.","word":"Rez-up"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b925"},"definition":" n.  To gather a group of friends together in a car and get out of Troy.","word":"Road Trip"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b926"},"definition":" n.  (RPI) A student of Russell Sage College, who is typified (by RPI men) as a slightly overweight ``MRS'' degree candidate.","word":"Sagie"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b914"},"definition":" n. (RPI) The avant-garde actors' troupe on the RPI campus composed of mostly students, which has been in continuous production since 1927. They are housed in the 15th Street Playhouse.","word":"Players"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b927"},"definition":" n.  Someone who is either climbing a tall campus building, or one who has just landed after a fall off a tall campus building. (See Vector.)","word":"Scalar"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b928"},"definition":" v. To take repetitively until none is left.","word":"Scarf"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b929"},"definition":" n.  (RPI) A particular mutation of RPI's regular curriculum in which students are given the responsibility of administering the Tute Screw to themselves. Sometimes called ``Self Abuse.''","word":"Self Screw"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b92a"},"definition":" n. The IBM 370/3081D computer which, according to reliable sources, lives in the basement of the VCC, and controls everything in the world, from the faculty's paychecks to your phone bills.","word":"Sibyl"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b92c"},"definition":" n. The free intra-campus mail system.  Not noted for it's speed.","word":"Snail Mail"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b92d"},"definition":" n. Beer, Whiskey, Vodka, Rum, ... anything that will try to annihilate your digestive tract through alcoholic reactions.","word":"Solvent"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b92b"},"definition":" n. One who lies about ignoring the Universe at large. --- v. (-ing) To slug. See Couch Potato.","word":"Slug"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b92e"},"definition":" n.  (RPI) Elite group of students whose cumes are less than the square root of their cumes.","word":"Square Root Club"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b930"},"definition":" n.  (RPI) The large blue water tower that is behind the RAHP and in the sights of the Lineac.","word":"Space Invader"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b92f"},"definition":" n., acronym. (RPI) The Saratoga Performing Arts Center, yet another center which is the site of many concerts.","word":"SPAC"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b931"},"definition":" n. Naval ROTC type.","word":"Squid"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b932"},"definition":" n.  Anything and everything (pronounced ``star-dot-star'').","word":"*.*"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b933"},"definition":" n. A buzzword prevalent around the end of the spring semes-ter, it is a common method of rating the ``value'' of one's diploma.","word":"Starting Salary"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b935"},"definition":" n., acronym.  (RPI) State University of Nubile Young Airheads.","word":"SUNYA"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b934"},"definition":" n. (RPI) One who actively (or obsessively) participates in Student Government.","word":"Stu-Gov"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b936"},"definition":" n.  Unfortunate gradual student who is forced to teach undergrads who speak a foreign tongue, English.","word":"TA"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b937"},"definition":" n. (RPI) For many campus buildings, the floor where the main doors are.","word":"Third Floor"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b938"},"definition":" n.  The Total Mall Experience.  Otherwise known as shopping at Crossgates Mall, the ultimate suburban mall in Upstate New York. Be there, aloha.","word":"TME"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b93a"},"definition":" n.  One who studies considerably.  v. -ing, to study excessively.","word":"Tool"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b939"},"definition":" n. One who studies, and studies, and ...","word":"Toad"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b93b"},"definition":" n.  (RPI) One of many shorter versions of RPI's name, devised to help students who cannot spell the whole thing.","word":"Tute"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b93c"},"definition":" n. (RPI) To quote the Rensselaer Student Handbook, ``A peculiar device ...  whichever way you turn it, it goes in.''","word":"Tute Screw"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b93d"},"definition":" n.  A person who has had his common sense surgically removed.","word":"Twink"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b93e"},"definition":" n.  (RPI) The god of high voltage, whose servants are known as Ni-Mo (q.v.).  To commune with Ultor, poke a paper clip into the wall socket ...","word":"Ultor"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b93f"},"definition":" n. A computer programmer who believes everything you tell him.","word":"User"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b940"},"definition":" n.  (RPI, pronounced ``Vee-See-See'') The Voorhees Computing Center, often confused with the Chapel and Cultural Center as the seat of religious power on campus.","word":"VCC"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b941"},"definition":" n. (1.) In mathematics, a one dimensional matrix.  (2.) Someone who is falling off a tall building. Derives from the last cry of the falling body, ``I'm a vector!''","word":"Vector"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b942"},"definition":" n.  Any vehicle capable of traveling faster than walking.","word":"Whoosh"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b943"},"definition":" n.  (RPI) The campus 10-kilowatt radio station that can be found 91.5 MHz on your FM radio dial, which specializes in not specializing in music. Pronounced ``Whirpee.''","word":"WRPI"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b945"},"definition":" n. Pizza. Another staple of the Rensselaer Diet.","word":"Za"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b944"},"definition":" n.  A new version of MTS that became operational in the Fall 84 semester.  Translated, it means ``Extended Aggravation.''","word":"XA"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b947"},"definition":" n. Calzone, a folded-over za.","word":"Zone"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b946"},"definition":" n.  The huge vehicle that clears the ice in the Houston Field House. Not a good car for road trips.","word":"Zamboni"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b948"},"definition":" n. Air Force ROTC type.","word":"Zoomie"}
{"_id":{"$oid":"56fe9e22bad6b23cde07b949"},"definition":" v.  To copy onto a reused piece of magnetic tape, e.g., cassette or video tape.","word":"Zurn"}
{"_id":{"$oid":"5841ab10507638e05269b720"},"word":"chair","definition":"Something you sit on"}
